actix-files/benchmark-test.txt
#### ORIGINAL			####
#### -l info -w 4 		####
#### -c 1 -n 10000 		####
#### test.jpg 88,749 bytes 	####

Adrians-MacBook-Pro:actix-files adrian$ ab -c 1 -n 10000 127.0.0.1:8080/assets/sub/test.jpg
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /assets/sub/test.jpg
Document Length:        88749 bytes

Concurrency Level:      1
Time taken for tests:   22.617 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      890120000 bytes
HTML transferred:       887490000 bytes
Requests per second:    442.15 [#/sec] (mean)
Time per request:       2.262 [ms] (mean)
Time per request:       2.262 [ms] (mean, across all concurrent requests)
Transfer rate:          38434.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       4
Processing:     1    2   3.3      1      21
Waiting:        0    1   0.5      1       8
Total:          1    2   3.3      1      21

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      3
  95%     14
  98%     14
  99%     15
 100%     21 (longest request)
Adrians-MacBook-Pro:actix-files adrian$ 



#### ORIGINAL			####
#### -l info -w 4 		####
#### -c 1 -n 10000 		####
#### test1.txt 6 bytes	 	####

Adrians-MacBook-Pro:actix-files adrian$ ab -c 1 -n 10000 127.0.0.1:8080/assets/test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /assets/test1.txt
Document Length:        6 bytes

Concurrency Level:      1
Time taken for tests:   13.951 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2620000 bytes
HTML transferred:       60000 bytes
Requests per second:    716.82 [#/sec] (mean)
Time per request:       1.395 [ms] (mean)
Time per request:       1.395 [ms] (mean, across all concurrent requests)
Transfer rate:          183.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    1   3.2      0      20
Waiting:        0    0   0.2      0       6
Total:          0    1   3.2      1      21

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      6
  98%     15
  99%     16
 100%     21 (longest request)
Adrians-MacBook-Pro:actix-files adrian$ 



#### BUFFERED	(+92%)		####
#### -l info -w 4 		####
#### -c 1 -n 10000 		####
#### test.jpg 88,749 bytes 	####

Adrians-MacBook-Pro:actix-files adrian$ ab -c 1 -n 10000 127.0.0.1:8080/assets/sub/test.jpg
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /assets/sub/test.jpg
Document Length:        228 bytes

Concurrency Level:      1
Time taken for tests:   11.777 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      3600000 bytes
HTML transferred:       2280000 bytes
Requests per second:    849.09 [#/sec] (mean)
Time per request:       1.178 [ms] (mean)
Time per request:       1.178 [ms] (mean, across all concurrent requests)
Transfer rate:          298.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       7
Processing:     0    1   3.0      0      26
Waiting:        0    1   3.0      0      26
Total:          0    1   3.0      0      26

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%     16
  99%     17
 100%     26 (longest request)
Adrians-MacBook-Pro:actix-files adrian$ 



#### BUFFERED	(+28%)		####
#### -l info -w 4 		####
#### -c 1 -n 10000 		####
#### test1.txt 6 bytes	 	####

Adrians-MacBook-Pro:actix-files adrian$ ab -c 1 -n 10000 127.0.0.1:8080/assets/test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /assets/test1.txt
Document Length:        228 bytes

Concurrency Level:      1
Time taken for tests:   10.840 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      3600000 bytes
HTML transferred:       2280000 bytes
Requests per second:    922.51 [#/sec] (mean)
Time per request:       1.084 [ms] (mean)
Time per request:       1.084 [ms] (mean, across all concurrent requests)
Transfer rate:          324.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    1   3.1      0      29
Waiting:        0    1   3.1      0      29
Total:          0    1   3.1      0      30

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      1
  80%      1
  90%      1
  95%      1
  98%     16
  99%     16
 100%     30 (longest request)
Adrians-MacBook-Pro:actix-files adrian$